In [ ]:
# Problem 1 - Sorting:
import pandas as pd
titanic = pd.read_csv("/content/drive/MyDrive/Concepts of AI/Datasets/Titanic-Dataset.csv")

# 1
fare = titanic[['Fare']]
print(fare.head())

# 2
class_age = titanic[['Pclass', 'Age']]
print("\n",class_age.head())

# 3
survived_gender = titanic[['Survived', 'Sex']]
print("\n",survived_gender.head())

      Fare
0   7.2500
1  71.2833
2   7.9250
3  53.1000
4   8.0500

    Pclass   Age
0       3  22.0
1       1  38.0
2       3  26.0
3       1  35.0
4       3  35.0

    Survived     Sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male

In [ ]:
#Problem - 2 - Subsetting:
# Subsetting Rows:
import pandas as pd

# Load the Titanic dataset
titanic = pd.read_csv("/content/drive/MyDrive/Concepts of AI/Datasets/Titanic-Dataset.csv")

# 1
fare_gt_100 = titanic[titanic['Fare'] > 100][['Name', 'Fare', 'Pclass']]
print("Passengers with Fare > 100:")
print(fare_gt_100)

# 2
first_class = titanic[titanic['Pclass'] == 1][['Name', 'Pclass', 'Age']]
print("\nPassengers in First Class (Pclass = 1):")
print(first_class)

# 3
female_under_18 = titanic[(titanic['Age'] < 18) & (titanic['Sex'] == 'female')][['Name', 'Age', 'Sex']]
print("\nFemale passengers under 18:")
print(female_under_18)

Passengers with Fare > 100:
                                                  Name      Fare  Pclass
27                      Fortune, Mr. Charles Alexander  263.0000       1
31      Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208       1
88                          Fortune, Miss. Mabel Helen  263.0000       1
118                           Baxter, Mr. Quigg Edmond  247.5208       1
195                               Lurette, Miss. Elise  146.5208       1
215                            Newell, Miss. Madeleine  113.2750       1
258                                   Ward, Miss. Anna  512.3292       1
268      Graham, Mrs. William Thompson (Edith Junkins)  153.4625       1
269                             Bissette, Miss. Amelia  135.6333       1
297                       Allison, Miss. Helen Loraine  151.5500       1
299    Baxter, Mrs. James (Helene DeLaudeniere Chaput)  247.5208       1
305                     Allison, Master. Hudson Trevor  151.5500       1
306                            Fleming, Miss. Margaret  110.8833       1
307  Penasco y Castellana, Mrs. Victor de Satode (M...  108.9000       1
311                         Ryerson, Miss. Emily Borie  262.3750       1
318                           Wick, Miss. Mary Natalie  164.8667       1
319  Spedden, Mrs. Frederic Oakley (Margaretta Corn...  134.5000       1
325                           Young, Miss. Marie Grice  135.6333       1
332                          Graham, Mr. George Edward  153.4625       1
334  Frauenthal, Mrs. Henry William (Clara Heinshei...  133.6500       1
337                    Burns, Miss. Elizabeth Margaret  134.5000       1
341                     Fortune, Miss. Alice Elizabeth  263.0000       1
373                                Ringhini, Mr. Sante  135.6333       1
377                          Widener, Mr. Harry Elkins  211.5000       1
380                              Bidois, Miss. Rosalie  227.5250       1
390                         Carter, Mr. William Ernest  120.0000       1
393                             Newell, Miss. Marjorie  113.2750       1
435                          Carter, Miss. Lucile Polk  120.0000       1
438                                  Fortune, Mr. Mark  263.0000       1
498    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  151.5500       1
505         Penasco y Castellana, Mr. Victor de Satode  108.9000       1
527                                 Farthing, Mr. John  221.7792       1
537                                LeRoy, Miss. Bertha  106.4250       1
544                         Douglas, Mr. Walter Donald  106.4250       1
550                        Thayer, Mr. John Borland Jr  110.8833       1
557                                Robbins, Mr. Victor  227.5250       1
581  Thayer, Mrs. John Borland (Marian Longstreth M...  110.8833       1
609                          Shutes, Miss. Elizabeth W  153.4625       1
659                         Newell, Mr. Arthur Webster  113.2750       1
660                      Frauenthal, Dr. Henry William  133.6500       1
679                 Cardeza, Mr. Thomas Drake Martinez  512.3292       1
689                  Madill, Miss. Georgette Alexandra  211.3375       1
698                           Thayer, Mr. John Borland  110.8833       1
700  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  227.5250       1
708                               Cleaver, Miss. Alice  151.5500       1
716                      Endres, Miss. Caroline Louise  227.5250       1
730                      Allen, Miss. Elisabeth Walton  211.3375       1
737                             Lesurer, Mr. Gustave J  512.3292       1
742              Ryerson, Miss. Susan Parker "Suzette"  262.3750       1
763          Carter, Mrs. William Ernest (Lucile Polk)  120.0000       1
779  Robert, Mrs. Edward Scott (Elisabeth Walton Mc...  211.3375       1
802                Carter, Master. William Thornton II  120.0000       1
856         Wick, Mrs. George Dennick (Mary Hitchcock)  164.8667       1

Passengers in First Class (Pclass = 1):
                                                  Name  Pclass   Age
1    Cumings, Mrs. John Bradley (Florence Briggs Th...       1  38.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)       1  35.0
6                              McCarthy, Mr. Timothy J       1  54.0
11                            Bonnell, Miss. Elizabeth       1  58.0
23                        Sloper, Mr. William Thompson       1  28.0
..                                                 ...     ...   ...
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)       1  47.0
872                           Carlsson, Mr. Frans Olof       1  33.0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)       1  56.0
887                       Graham, Miss. Margaret Edith       1  19.0
889                              Behr, Mr. Karl Howell       1  26.0

[216 rows x 3 columns]

Female passengers under 18:
                                                  Name    Age     Sex
9                  Nasser, Mrs. Nicholas (Adele Achem)  14.00  female
10                     Sandstrom, Miss. Marguerite Rut   4.00  female
14                Vestrom, Miss. Hulda Amanda Adolfina  14.00  female
22                         McGowan, Miss. Anna "Annie"  15.00  female
24                       Palsson, Miss. Torborg Danira   8.00  female
39                         Nicola-Yarred, Miss. Jamila  14.00  female
43            Laroche, Miss. Simonne Marie Anne Andree   3.00  female
58                        West, Miss. Constance Mirium   5.00  female
68                     Andersson, Miss. Erna Alexandra  17.00  female
71                          Goodwin, Miss. Lillian Amy  16.00  female
84                                 Ilett, Miss. Bertha  17.00  female
111                               Zabour, Miss. Hileni  14.50  female
114                              Attalah, Miss. Malake  17.00  female
119                  Andersson, Miss. Ellis Anna Maria   2.00  female
147                   Ford, Miss. Robina Maggie "Ruby"   9.00  female
156                   Gilnagh, Miss. Katherine "Katie"  16.00  female
172                       Johnson, Miss. Eleanor Ileen   1.00  female
184                Kink-Heilmann, Miss. Luise Gretchen   4.00  female
205                         Strom, Miss. Telma Matilda   2.00  female
208                          Carr, Miss. Helen "Ellen"  16.00  female
233                     Asplund, Miss. Lillian Gertrud   5.00  female
237                   Collyer, Miss. Marjorie "Lottie"   8.00  female
297                       Allison, Miss. Helen Loraine   2.00  female
307  Penasco y Castellana, Mrs. Victor de Satode (M...  17.00  female
329                       Hippach, Miss. Jean Gertrude  16.00  female
374                         Palsson, Miss. Stina Viola   3.00  female
381                        Nakid, Miss. Maria ("Mary")   1.00  female
389                              Lehmann, Miss. Bertha  17.00  female
419                          Van Impe, Miss. Catharina  10.00  female
435                          Carter, Miss. Lucile Polk  14.00  female
446                  Mellinger, Miss. Madeleine Violet  13.00  female
448                     Baclini, Miss. Marie Catherine   5.00  female
469                      Baclini, Miss. Helene Barbara   0.75  female
479                           Hirvonen, Miss. Hildur E   2.00  female
504                              Maioni, Miss. Roberta  16.00  female
530                           Quick, Miss. Phyllis May   2.00  female
535                             Hart, Miss. Eva Miriam   7.00  female
541               Andersson, Miss. Ingeborg Constanzia   9.00  female
542                  Andersson, Miss. Sigrid Elisabeth  11.00  female
618                        Becker, Miss. Marion Louise   4.00  female
634                                 Skoog, Miss. Mabel   9.00  female
642                      Skoog, Miss. Margit Elizabeth   2.00  female
644                             Baclini, Miss. Eugenie   0.75  female
689                  Madill, Miss. Georgette Alexandra  15.00  female
691                                 Karun, Miss. Manca   4.00  female
720                  Harper, Miss. Annie Jessie "Nina"   6.00  female
750                                  Wells, Miss. Joan   4.00  female
777                      Emanuel, Miss. Virginia Ethel   5.00  female
780                               Ayoub, Miss. Banoura  13.00  female
781          Dick, Mrs. Albert Adrian (Vera Gillespie)  17.00  female
813                 Andersson, Miss. Ebba Iris Alfrida   6.00  female
830            Yasbeck, Mrs. Antoni (Selini Alexander)  15.00  female
852                            Boulos, Miss. Nourelain   9.00  female
853                          Lines, Miss. Mary Conover  16.00  female
875                   Najib, Miss. Adele Kiamie "Jane"  15.00  female

In [ ]:
# Subsetting Rows by Categorical variables:
import pandas as pd
titanic = pd.read_csv("/content/drive/MyDrive/Concepts of AI/Datasets/Titanic-Dataset.csv")

# 1
embarked_c_or_s = titanic[titanic['Embarked'].isin(['C', 'S'])][['Name', 'Embarked', 'Pclass']]
print("Passengers who Embarked at 'C' or 'S':")
print(embarked_c_or_s)

# 2
first_second_class = titanic[titanic['Pclass'].isin([1, 2])][['Name', 'Pclass', 'Age']]
print("\nPassengers in First or Second Class (Pclass = 1 or 2):")
print(first_second_class)

Passengers who Embarked at 'C' or 'S':
                                                  Name Embarked  Pclass
0                              Braund, Mr. Owen Harris        S       3
1    Cumings, Mrs. John Bradley (Florence Briggs Th...        C       1
2                               Heikkinen, Miss. Laina        S       3
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)        S       1
4                             Allen, Mr. William Henry        S       3
..                                                 ...      ...     ...
884                             Sutehall, Mr. Henry Jr        S       3
886                              Montvila, Rev. Juozas        S       2
887                       Graham, Miss. Margaret Edith        S       1
888           Johnston, Miss. Catherine Helen "Carrie"        S       3
889                              Behr, Mr. Karl Howell        C       1

[812 rows x 3 columns]

Passengers in First or Second Class (Pclass = 1 or 2):
                                                  Name  Pclass   Age
1    Cumings, Mrs. John Bradley (Florence Briggs Th...       1  38.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)       1  35.0
6                              McCarthy, Mr. Timothy J       1  54.0
9                  Nasser, Mrs. Nicholas (Adele Achem)       2  14.0
11                            Bonnell, Miss. Elizabeth       1  58.0
..                                                 ...     ...   ...
880       Shelley, Mrs. William (Imanita Parrish Hall)       2  25.0
883                      Banfield, Mr. Frederick James       2  28.0
886                              Montvila, Rev. Juozas       2  27.0
887                       Graham, Miss. Margaret Edith       1  19.0
889                              Behr, Mr. Karl Howell       1  26.0

[400 rows x 3 columns]

In [ ]:
# 3.2 Exploratory Data Analysis Practice Exercise
# Which passenger had the highest fare paid relative to their age?
import pandas as pd
titanic = pd.read_csv("/content/drive/MyDrive/Concepts of AI/Datasets/Titanic-Dataset.csv")

# 1
titanic['fare_per_year'] = titanic['Fare'] / titanic['Age']
titanic['fare_per_year'] = titanic['fare_per_year'].fillna(0)

# 2
high_fare_age = titanic[titanic['fare_per_year'] > 5]

# 3
high_fare_age_srt = high_fare_age.sort_values(by='fare_per_year', ascending=False)

# 4
result = high_fare_age_srt[['Name', 'fare_per_year']]

# 5
print(result)

                                       Name  fare_per_year
305          Allison, Master. Hudson Trevor     164.728261
297            Allison, Miss. Helen Loraine      75.775000
386         Goodwin, Master. Sidney Leonard      46.900000
164            Panula, Master. Eino Viljami      39.687500
183               Becker, Master. Richard F      39.000000
..                                      ...            ...
318                Wick, Miss. Mary Natalie       5.318281
348  Coutts, Master. William Loch "William"       5.300000
205              Strom, Miss. Telma Matilda       5.231250
813      Andersson, Miss. Ebba Iris Alfrida       5.212500
480          Goodwin, Master. Harold Victor       5.211111

[68 rows x 2 columns]

In [ ]:
# Which adult male passenger (age ≥ 18 and Sex is ’male’) paid the highest fare relative to their class?
import pandas as pd
titanic = pd.read_csv("/content/drive/MyDrive/Concepts of AI/Datasets/Titanic-Dataset.csv")

# 1
titanic['fare_per_class'] = titanic['Fare'] / titanic['Pclass']

# 2
adult_males = titanic[(titanic['Sex'] == 'male') & (titanic['Age'] >= 18)]

# 3
adult_males_srt = adult_males.sort_values(by='fare_per_class', ascending=False)

# 4
result = adult_males_srt[['Name', 'Age', 'fare_per_class']]

# 5
print(result)

                                   Name   Age  fare_per_class
737              Lesurer, Mr. Gustave J  35.0        512.3292
679  Cardeza, Mr. Thomas Drake Martinez  36.0        512.3292
27       Fortune, Mr. Charles Alexander  19.0        263.0000
438                   Fortune, Mr. Mark  64.0        263.0000
118            Baxter, Mr. Quigg Edmond  24.0        247.5208
..                                  ...   ...             ...
271        Tornquist, Mr. William Henry  25.0          0.0000
179                 Leonard, Mr. Lionel  36.0          0.0000
302     Johnson, Mr. William Cahoone Jr  19.0          0.0000
822     Reuchlin, Jonkheer. John George  38.0          0.0000
806              Andrews, Mr. Thomas Jr  39.0          0.0000

[395 rows x 3 columns]

In [ ]:
# 3.3 Exploratory Data Analysis with Group-by Method Practice Exercise:
# What percent of the total fare revenue came from each passenger class?
import pandas as pd
titanic = pd.read_csv("/content/drive/MyDrive/Concepts of AI/Datasets/Titanic-Dataset.csv")

# 1
total_fare = titanic['Fare'].sum()
print(f"Total Fare: {total_fare}")

# 2
first_class_fare = titanic[titanic['Pclass'] == 1]['Fare'].sum()
print(f"Total Fare for First Class: {first_class_fare}")

# 3
second_class_fare = titanic[titanic['Pclass'] == 2]['Fare'].sum()
print(f"Total Fare for Second Class: {second_class_fare}")

third_class_fare = titanic[titanic['Pclass'] == 3]['Fare'].sum()
print(f"Total Fare for Third Class: {third_class_fare}")

# 4
fare_totals = [first_class_fare, second_class_fare, third_class_fare]
print(f"Fare Totals by Class: {fare_totals}")

# 5
fare_proportions = [fare / total_fare for fare in fare_totals]
print(f"Fare Revenue Proportions by Class: {fare_proportions}")

Total Fare: 28693.9493
Total Fare for First Class: 18177.4125
Total Fare for Second Class: 3801.8417
Total Fare for Third Class: 6714.6951
Fare Totals by Class: [18177.4125, 3801.8417, 6714.6951]
Fare Revenue Proportions by Class: [0.6334928771899656, 0.1324962855496507, 0.23401083726038366]

In [ ]:
# What percent of the total number of passengers on the Titanic belonged to each age group (e.g., child, adult, senior)?
import pandas as pd
titanic = pd.read_csv("/content/drive/MyDrive/Concepts of AI/Datasets/Titanic-Dataset.csv")

# 1
titanic['age_group'] = pd.cut(
    titanic['Age'],
    bins=[-float('inf'), 18, 64, float('inf')],
    labels=['child', 'adult', 'senior']
)

# 2
total_passengers = len(titanic)
print(f"Total number of passengers: {total_passengers}")

# 3
age_group_counts = titanic['age_group'].value_counts()
print(f"\nPassenger counts by age group:\n{age_group_counts}")

# 4
age_group_proportions = (age_group_counts / total_passengers) * 100

# 5
print(f"\nPassenger proportions by age group (%):\n{age_group_proportions}")

Total number of passengers: 891

Passenger counts by age group:
age_group
adult     564
child     139
senior     11
Name: count, dtype: int64

Passenger proportions by age group (%):
age_group
adult     63.299663
child     15.600449
senior     1.234568
Name: count, dtype: float64